"""
ТЕМА: Раскрашивание консоли (ANSI-коды)
"""

# ===== Смена цвета текста =====
print('\033[31mHello, world!\033[0m')    # red
print('\033[33mHello, world!\033[0m')    # yellow
print('\033[32mHello, world!\033[0m')    # green

# ===== Смена цвета фона =====
print('\033[47mHello, world!\033[0m')   # white background
print('\033[31;43mHello, world!\033[0m')    # FC: red, BC: yellow

# ===== RGB-цвета =====
print('\033[38;5;150mЭто цветной текст\033[0m') # 38 - цвет текста
print('\033[48;5;150mЭто текст на цветном фоне\033[0m') # 48 - цвет фона

# ===== Стили =====
print('\033[3mЭтот текст написан курсивом\033[0m') 
print('\033[1mЭтот текст написан жирным\033[0m')
print('\033[4mЭтот текст подчеркнутый\033[0m')
